In [3]:
set.seed(1)
x = runif(10)
y = letters[1:10]
z = sample(c(rep(T,5),rep(F,5)))

In [4]:
new = data.frame(y,z,x)

In [5]:
new

   y z     x
1  a  TRUE 0.26550866
2  b  TRUE 0.37212390
3  c  TRUE 0.57285336
4  d FALSE 0.90820779
5  e  TRUE 0.20168193
6  f FALSE 0.89838968
7  g FALSE 0.94467527
8  h FALSE 0.66079779
9  i  TRUE 0.62911404
10 j FALSE 0.06178627

- 포아송분포와 관련된 함수들
  - dpois : 확률밀도함수(probability density function)

  - ppois : 누적분포함수(cumulative distribution function)

  - qpois : 누적분포함수의 역함수(inverse cumulative distribution function)

  - rpois : 임의추출

In [6]:
set.seed(1)
y =rpois(1500,1.5)

table(y)

y
  0   1   2   3   4   5   6   7   8
342 532 340 179  83  18   4   1   1

In [7]:
short = as.data.frame(table(y))

In [8]:
short

  y Freq
1 0 342
2 1 532
3 2 340
4 3 179
5 4  83
6 5  18
7 6   4
8 7   1
9 8   1

In [10]:
index = rep(1:9,short$Freq)
length(index)

[1] 1500

In [11]:
long = short[index,]

In [14]:
tail(long)

    y Freq
7   6 4
7.1 6 4
7.2 6 4
7.3 6 4
8   7 1
9   8 1

In [15]:
baseurl <- "http://www.bio.ic.ac.uk/research/mjcraw/therbook/data/"
filename <- "dups.txt"
(fileurl <- paste(baseurl, filename, sep=""))

[1] "http://www.bio.ic.ac.uk/research/mjcraw/therbook/data/dups.txt"

In [16]:
df = read.table(fileurl,header=TRUE)

In [17]:
head(df)

  cow dog cat bat
1 1   2   3   1
2 1   2   2   1
3 3   2   1   1
4 4   4   2   1
5 3   2   1   1
6 6   1   2   5

In [18]:
unique(df)

  cow dog cat bat
1 1   2   3   1
2 1   2   2   1
3 3   2   1   1
4 4   4   2   1
6 6   1   2   5
7 1   2   3   2

In [20]:
df[duplicated(df),]

  cow dog cat bat
5 3   2   1   1

In [21]:
url1 <- "http://www.bio.ic.ac.uk/research/mjcraw/therbook/data/lifeforms.txt"

In [22]:
df1 = read.table(url1, header=TRUE)

In [23]:
df1

  Genus  species     lifeform
1 Acer   platanoides tree
2 Acer   palmatum    tree
3 Ajuga  reptans     herb
4 Conyza sumatrensis annual
5 Lamium album       herb

In [24]:
url2 <- "http://www.bio.ic.ac.uk/research/mjcraw/therbook/data/fltimes.txt"
(df2 <- read.table(url2, header=TRUE))

  Genus     species       flowering
1 Acer      platanoides   May
2 Ajuga     reptans       June
3 Brassica  napus         April
4 Chamerion angustifolium July
5 Conyza    bilbaoana     August
6 Lamium    album         January

In [25]:
merge(df1,df2)

  Genus  species     lifeform flowering
1 Acer   platanoides tree     May
2 Ajuga  reptans     herb     June
3 Lamium album       herb     January

In [26]:
both = merge(df1,df2,all=T)

In [27]:
both

  Genus     species       lifeform flowering
1 Acer      palmatum      tree     NA
2 Acer      platanoides   tree     May
3 Ajuga     reptans       herb     June
4 Brassica  napus         NA       April
5 Chamerion angustifolium NA       July
6 Conyza    bilbaoana     NA       August
7 Conyza    sumatrensis   annual   NA
8 Lamium    album         herb     January

In [28]:
url3 <- "http://www.bio.ic.ac.uk/research/mjcraw/therbook/data/seedwts.txt"
(df3 <- read.table(url3, header=TRUE))

  name1     name2         seed
1 Acer      platanoides   32.0
2 Lamium    album         12.0
3 Ajuga     reptans        4.0
4 Chamerion angustifolium  1.5
5 Conyza    bilbaoana      0.5
6 Brassica  napus          7.0
7 Acer      palmatum      21.0
8 Conyza    sumatrensis    0.6

In [30]:
merge(both,df3,by.x=c("Genus","species"),by.y=c("name1","name2"))

  Genus     species       lifeform flowering seed
1 Acer      palmatum      tree     NA        21.0
2 Acer      platanoides   tree     May       32.0
3 Ajuga     reptans       herb     June       4.0
4 Brassica  napus         NA       April      7.0
5 Chamerion angustifolium NA       July       1.5
6 Conyza    bilbaoana     NA       August     0.5
7 Conyza    sumatrensis   annual   NA         0.6
8 Lamium    album         herb     January   12.0

In [31]:
url <- "http://www.bio.ic.ac.uk/research/mjcraw/therbook/data/sales.txt"

In [32]:
sales = read.table(url,header=TRUE)

In [33]:
head(sales)

  name            spring summer autumn winter
1 Jane.Smith      14     18     11     12
2 Robert.Jones    17     18     10     13
3 Dick.Rogers     12     16      9     14
4 William.Edwards 15     14     11     10
5 Janet.Jones     11     17     11     16

In [39]:
people_mean = rowMeans(sales[,2:5])

In [40]:
people_mean

[1] 13.75 14.50 12.75 12.50 13.75

In [41]:
mean(people_mean)

[1] 13.45

In [42]:
diff_mean <- people_mean  - mean(people_mean )

In [43]:
diff_mean

[1]  0.30  1.05 -0.70 -0.95  0.30

In [44]:
new_sales = cbind(sales, diff_mean)

In [45]:
new_sales

  name            spring summer autumn winter diff_mean
1 Jane.Smith      14     18     11     12      0.30
2 Robert.Jones    17     18     10     13      1.05
3 Dick.Rogers     12     16      9     14     -0.70
4 William.Edwards 15     14     11     10     -0.95
5 Janet.Jones     11     17     11     16      0.30

In [47]:
seasons_mean = colMeans(sales[,2:5])

In [49]:
seasons_mean

spring summer autumn winter
  13.8   16.6   10.4   13.0

In [50]:
(seasons <- seasons_mean - mean(seasons_mean))
seasons

spring summer autumn winter
  0.35   3.15  -3.05  -0.45

spring summer autumn winter
  0.35   3.15  -3.05  -0.45

In [51]:
seasons

spring summer autumn winter
  0.35   3.15  -3.05  -0.45

In [61]:
new.row <- new_sales[1, ]

In [62]:
new.row

  name       spring summer autumn winter diff_mean
1 Jane.Smith 14     18     11     12     0.3

In [63]:
new.row[2]

  spring
1 14

In [58]:
new.row[1] <- "seasonal effects"

In [59]:
new.row

  name             spring summer autumn winter diff_mean
1 seasonal effects 14     18     11     12     0.3

In [60]:
new.row[1]

  name
1 seasonal effects

In [64]:
seasons

spring summer autumn winter
  0.35   3.15  -3.05  -0.45

In [65]:
new.row[2:5] = seasons

In [66]:
new.row[6] = 0

In [67]:
new.row

  name       spring summer autumn winter diff_mean
1 Jane.Smith 0.35   3.15   -3.05  -0.45  0

In [70]:

new.frame = rbind(new_sales, new.row)

In [71]:
new.frame

  name            spring summer autumn winter diff_mean
1 Jane.Smith      14.00  18.00  11.00  12.00   0.30
2 Robert.Jones    17.00  18.00  10.00  13.00   1.05
3 Dick.Rogers     12.00  16.00   9.00  14.00  -0.70
4 William.Edwards 15.00  14.00  11.00  10.00  -0.95
5 Janet.Jones     11.00  17.00  11.00  16.00   0.30
6 Jane.Smith       0.35   3.15  -3.05  -0.45   0.00